[
{"url": "https://kyivindependent.com/un-expresses-shock-after-russias-strike-on-kryvyi-rih-kills-record-number-of-children-in-war/", "title": "Top UN official expresses 'shock' at Russia's deadly strike on Kryvyi Rih", "content": "Volker Türk, the UN High Commissioner for Human Rights, “expressed shock” on April 6 at Russia’s April 4 missile strike on Kryvyi Rih, which killed nine children. The attack killed 19 people, including nine children, the local authorities . Four more children who were injured during the attack are in serious condition at the hospital, according to their report. \"It’s an unimaginable horror — nine children killed, most while playing in a park, as a military weapon exploded into shrapnel above them,\" Türk said in a released by the UN. \"The use of an explosive weapon with wide area effects by the Russian Federation in a densely populated area —and without any apparent military presence — demonstrates a reckless disregard for civilian life.\" The local UN team visited the attack site on April 5 to document the damage and identify the children killed in the strike, according to the statement. The UN's reaction comes as President Volodymyr Zelensky calls on Western allies to do more, stressing that \"the pressure on Russia is still not enough.\" \"The number of air attacks is growing,\" Zelensky in a Telegram post. , Zelensky's hometown, remains a frequent of Russian attacks. The city, home to about 660,000 people, is the second-largest in and lies roughly 70 kilometers (40 miles) from the front line. With Russia still being a permanent member of the UN Security Council, the intergovernmental organization has largely refrained from directly condemning Moscow for its war crimes and has responded with caution."},
{"url": "https://kyivindependent.com/musks-x-platform-faces-potential-1-billion-fine-from-eu-regulators-over-disinformation-violations-nyt-reports/", "title": "Musk's X platform faces potential $1 billion fine from EU regulators over disinformation violations, NYT reports", "content": "Elon Musk’s social media platform X may face fines exceeding $1 billion for allegedly violating the EU’s Digital Services Act (DSA), the New York Times (NYT) reported on April 4, citing four people familiar with the matter. The DSA, enacted in 2022, aims to reduce illegal and harmful content on major online platforms. The European Commission began formal proceedings against X in 2023 and has since warned that selling verified check marks could be misleading to users and in breach of the DSA. According to the , this would be the EU’s first enforcement action under the DSA, with possible penalties expected this summer. In addition to fines, X may be required to change key platform features to comply with the law. The EU is also investigating whether X’s limited content moderation has allowed hate speech and disinformation to flourish. Penalties under the DSA can reach up to 6% of a company’s global revenue, and officials are reportedly considering calculating X’s fine based on the combined revenue of all Elon Musk-owned companies, including SpaceX. X could avoid the fines by implementing the changes demanded by the European Commission, the NYT noted. The Global Government Affairs team at X responded and said that if the EU’s plans are true, it would represent an “unprecedented act of political censorship and an attack on free speech.” “X has gone above and beyond to comply with the EU’s Digital Services Act, and we will use every option at our disposal to defend our business, keep our users safe, and protect freedom of speech in Europe,” the team . Following billionaire Elon Musk's 2022 acquisition of X, formerly known as Twitter, the social media company has faced for increased levels of disinformation, and lack of effective moderation of the content shared there. Musk has himself promoted Russia-backed narratives about the war in Ukraine, including mocking Zelensky with memes portraying him as begging for financial aid, and echoing Kremlin propaganda that blames Ukraine—not Russia—for obstructing peace efforts."},
{"url": "https://kyivindependent.com/more-than-35-000-square-kilometers-demined-in-ukraine-pm-shmyhal-says/", "title": "More than 35,000 square kilometers demined in Ukraine, PM Shmyhal says", "content": "Over 35,000 square kilometers (13,513 square miles) of previously mined territory have been cleared since the start of Russia’s full-scale invasion, Prime Minister Denys Shmyhal said during a government meeting on April 4. “More than 174,000 square kilometers of territory have been affected by the war. Therefore, the government has identified humanitarian demining as one of the key priorities for recovery,” he . Shmyhal noted that more than 1,000 hectares of farmland have been demined, which is crucial for the sowing season and Ukraine’s agricultural exports. He emphasized that operations will continue and that the government will work on expanding capabilities. “Nearly 5,500 personnel, 260 demining vehicles, and 87 mine action operators are actively working to clear mines across the country,” Shmyhal said. Efforts to clear the Russian mines are expected to take over a decade and cost close to $35 billion, according to the Economy Ministry. Ukraine the most mined country in the world."},
{"url": "https://kyivindependent.com/macron-to-helm-eus-talks-with-putin-the-telegraph-reports/", "title": "Macron to helm EU's talks with Putin, the Telegraph reports", "content": "French President Emmanual Macron is readying to become Europe's point person in negotiations with Russian President Vladimir Putin, per the Telegraph. France and the United Kingdom are the main players within the \" \" that is toying with the creation of some form of peacekeeping force in a post-ceasefire Ukraine. Citing sources within French government, the Telegraph Macron's ascent to UK Prime Minister Keir Starmer's relative reticence. France is one of the few countries in NATO that conducts military operations independent of the U.S., primarily in missions in former colonies in West Africa. It likewise maintains an intelligence network separate from the U.S.-led Five Eyes, which came in when the U.S. cut off intel sharing for a week at the start of March. Macron has been one of the more vocal proponents of a European rearmament. But results remain uncertain. The unnamed official apparently said that it was \"apparently, not yet\" the time for Macron to lead the coalition. Similarly, the details of any peacekeeping commitment from the coalition, whether French or otherwise, remain vague, with Ukraine awaiting tangible help."},
{"url": "https://kyivindependent.com/european-leaders-condemn-russias-deadly-attack-on-kryvyi-rih/", "title": "European leaders condemn Russia's deadly attack on Kryvyi Rih", "content": "Several European officials condemned Russia's attack on the Ukrainian city of Kryvyi Rih on April 4, which killed 19 people and injured 68. Russian forces reportedly launched a combined on the city in the evening setting buildings ablaze in residential districts. Among those killed in the attack are nine children. Forty people have been hospitalized, according to local authorities. \"All of Europe is heading into the weekend, but Ukrainians are living in a different reality,\" Dutch Defense Minister wrote on X. \"Yet another Russian attack... This is why we must accelerate support for Ukraine!\" European Commission Vice-President also condemned the attack, calling it \"tragic and inhumane.\" \"Another reckless Russian attack struck a crowded residential area... Russia continues to destroy Ukraine, no interest in peace,\" Kallas wrote on X. In response to the attack, Estonian Foreign Minister said \"Russia seeks war, not peace and the attacks against civilians, incl(uding) children are brutal proof of it.\" \"Firing a missile at a children's playground — this is not war, this is barbarism,\" Czech Foreign Affairs Minister wrote on X. \"Our thoughts are with the families of the victims and with those defending their country against Russian terror.\" Lithuanian Foreign Affairs Minister posted photos of the attack on X, with the caption \"Ceasefire by (Russian President Vladimir) Putin.\" , Zelensky's hometown, remains a frequent of Russian attacks. The city, home to about 660,000 people, is the second-largest in and lies roughly 70 kilometers (40 miles) from the front line."},
{"url": "https://kyivindependent.com/russia-owes-an-answer-to-the-us-west-pushes-putin-on-ceasefire-deal/", "title": "'Russia owes an answer to the US' — West pushes Putin on ceasefire deal", "content": "After in Brussels on April 3 and 4, NATO's representatives are demanding an immediate response from Russian President Vladimir Putin to a ceasefire deal that the U.S. and Ukraine have already agreed to. “Today, Russia owes an answer to the U.S.,” said French Foreign Minister Jean-Noel Barrot, per . “It has to be yes, it has to be no — it has to be a quick answer.” “The ball clearly is in the court of the Russians,” NATO Secretary General Mark Rutte told CBS' . “They are not moving fast enough, is my impression, including the impression I’m getting from my American interlocutors, that Russia really has to do more to bring this war to an end. The Ukrainians are really close to the American position.” U.S. Secretary of State Marco Rubio said after the NATO convention, \"the message is, the United States needs to know whether you’re serious or not about peace. Ultimately, Putin will have to make that decision.\" The Kremlin's lead negotiator, Kirill Dmitriev, recently \"significant progress\" on the ceasefire deal. Delegations from the U.S. and Ukraine originally hashed out a general ceasefire agreement in March, but the Kremlin has dug its heels in. Putin's lack of cooperation and continued attacks, both and , on Ukraine and its president, Volodymyr Zelensky, have increasingly angered U.S. President Donald Trump in the past two weeks."},
{"url": "https://kyivindependent.com/ukrainian-drones-hit-russian-fiber-optic-factory-east-of-moscow/", "title": "Ukrainian drones hit Russian explosives,  fiber optic factories near Moscow", "content": "Ukrainian deep-strike drones hit Russian fiber-optic and explosives factories on the night of April 4. The strikes targeted factories in Samara and Mordovia oblasts. A source with the Ukrainian State Security Service (SBU) confirmed to the Kyiv Independent that they were behind at least the strikes in Samara Oblast. \"SBU strike drones attacked 'Promsintez' in Chapayevsk, in Samara Oblast. The factory is one of the leading manufacturers of explosives in the Russian Federation and the Commonwealth of Independent States,\" writes a source in the SBU, who said their drones hit the factory 20 times. \"As a result, the leadership of the factory have stopped their technological processes.\" from local media show attacks on Saransk in Moravia Oblast the same night. One local source the building hit as a factory belonging to a company called \"Fiber Optic Systems.\" Russian investigative outlet identifies Fiber Optic Systems  as the main producer of optical fiber in Russia. Fiber-optic drones are resistant to electronic warfare interference. Russia's mass production of such drones has greatly enhanced the offensive power of the Russian military, most notably in their recent of territory in Kursk Oblast. Insider similarly identified Fiber Optic Systems as a remarkably effective link in the chain providing Russia with for its war machine. The governors of both oblasts announced no as a result of the strikes. Of the Promsintez strike, the SBU source said in a statement, \"the SBU is continuing to work precisely through Russian businesses, that are part of the military-industrial complex and produce weapons for the war against Ukraine. Such objects are absolutely legal military targets.\" Ukraine has invested heavily in its long-range strike drone programs, as well as more traditional missiles, in an effort to reach Russian infrastructure far from the front. Russia, meanwhile, uses its much larger arsenal of ballistic missiles to strike civilian targets throughout Ukraine. One such strike hit a earlier today, killing 19, including 9 children."},
{"url": "https://kyivindependent.com/us-embassys-response-to-russias-kryvyi-rih-attack-unpleasantly-surprising-zelensky-says/", "title": "US embassy's response to Russia's Kryvyi Rih attack 'surprisingly disappointing,' Zelensky says.", "content": "The U.S. Embassy to Ukraine's response to Russia's attack on the Ukrainian city of Kryvyi Rih on April 4, which killed 19 people and injured 68, was \"unpleasantly surprising,\" President Volodymyr Zelensky said on April 5. \"Horrified that tonight a ballistic missile struck near a playground and restaurant in Kryvyi Rih,\" U.S. Ambassador Bridget Brink following a Russian ttack on Kryvyi Rih on April 4. \"This is why the war must end.\" Zelensky took issue with Brink's refusal to denounce Russia for the strike, which included an Iskander ballistic missile with cluster munition touching down on a playground in Zelensky's hometown. Horrified that tonight a ballistic missile struck near a playground and restaurant in Kryvyi Rih. More than 50 people injured and 16 killed, including 6 children. This is why the war must end. \"Unfortunately, the response from the U.S. Embassy is surprisingly disappointing — such a strong country, such a strong people, and yet such a weak reaction. They are afraid to even say the word 'Russian' when speaking about the missile that murdered children,\" Zelensky in response. \"We must pressure Russia — the one choosing to kill children instead of choosing a ceasefire.\" A roster of European leaders have already the attack on Kryvyi Rih. Many in NATO are likewise trying to on the Kremlin to sign on to the ceasefire agreement that Ukraine and the U.S. agreed to earlier in March."},
{"url": "https://kyivindependent.com/kyiv-is-hunting-for-whoever-leaked-the-u-s-minerals-deal-ft-reports/", "title": "Ukraine investigating leaked U.S. minerals deal, FT reports", "content": "Ukraine is reportedly investigating the source of a leaked draft of the minerals deal with the U.S. The administration of Ukrainian President Volodymyr Zelensky has directed the security services to find the leakers, the Financial Times . The measures include use of polygraph tests on those with access to the deal across several government ministries, though the Financial Times did not identify them specifically. The minerals deal is the pet project of U.S. President Donald Trump, who talks about it as a means of securing U.S. engagement with Ukraine via private industry investment. Opponents talk about it as colonial of Ukraine's resources. The actual details of the minerals deal seem to fluctuate regularly, but Ukrainian authorities including Zelensky have assented in general terms to the concept of U.S. miners coming into Ukraine. An earlier version of the deal did, however, fall apart in March. Negotiations are, however, very . Trump however recently accused Zelensky of “trying to back out” of the minerals deal."},
{"url": "https://kyivindependent.com/zelensky-welcomes-french-british-army-chiefs-in-kyiv-talks-troop-deployment/", "title": "Zelensky welcomes French, British army chiefs in Kyiv, talks troop deployment", "content": "President Volodymyr Zelensky had met on April 5 with British Admiral Antony Radakin and French General Thierry Burkhard who head the Defence Staff of their respective countries. \"There is tangible progress and initial details on how the partner security contingent might be deployed,\" Zelensky said. Zelensky also thanked the \"U.K. and France for their leadership\" in bringing together countries that would be open to deploying troops to Ukraine to monitor a potential ceasefire. On March 27, French President Emmanuel Macron hosted a summit in Paris where a number of European countries moved forward with plans to send soldiers to Ukraine as part of a in case of a ceasefire with Russia. In mid-March, U.K. Prime Minister Keir Starmer presented plans to send to Ukraine, which is significantly smaller than the he reportedly pitched to U.S. President Donald Trump during their White House meeting on Feb. 20. Though Starmer still publicly held out for a coalition deployment to be supported by a U.S. \"backstop,\" Macron said that it could take place \"with or without\" Washington's involvement."},
{"url": "https://kyivindependent.com/russian-attack-on-kryvyi-rih-kills-19-people-including-9-children-injures-68/", "title": "Russian attack on Kryvyi Rih kills 19 people, including 9 children, injures 74", "content": "Russia's missile attack on the Ukrainian city of Kryvyi Rih on April 4 killed 19 people, including nine children, according to Oleksandr Vilkul, the head of Kryvyi Rih's military administration. Russian forces reportedly launched a combined missile and drone attack on the Dnipropetrovsk Oblast city in the evening, setting in residential districts. The attack killed 19 people, Vilkul on April 5. Nine children were among the victims. Another 74 people sustained injuries, with victims ranging from senior citizens to a three-month-old infant. Thirty-seven of the wounded have been hospitalized. Two children, aged 5 and 8, are reportedly in critical condition, along with 15 other hospitalized victims. \"Doctors are fighting for their lives and providing all necessary assistance,\" Vilkul said. The attack reportedly damaged 34 apartment buildings and six educational facilities, as well as various shops, businesses, cars, and homes. Ukrainian President commented on the attack: \"\"Russian strikes every day. Every day, people are killed. There is only one reason this continues: Russia does not want a ceasefire, and we see it. The whole world sees it.\" \"Every Russian promise ends with missiles or drones, bombs or artillery. Diplomacy means nothing to them. And that’s why pressure is needed — sufficient pressure on Russia so they feel the consequences of every lie of theirs, every strike, every single day they take lives and prolong the war,\" Zelensky said. Several European leaders . \"Another reckless Russian attack struck a crowded residential area... Russia continues to destroy Ukraine, no interest in peace,\" European Commission Vice-President wrote on X, calling the attack \"tragic and inhumane.\" The Russian Defense Ministry claimed the attack on Kryvyi Rih was targeted at a military gathering, a claim the Ukrainian military dismissed as \"false information.\" , Zelensky's hometown, remains a frequent of Russian attacks. The city, home to about 660,000 people, is the second-largest in and lies roughly 70 kilometers (40 miles) from the front line."},
{"url": "https://kyivindependent.com/zelensky-russia-must-be-held-accountable-for-everything-it-has-done/", "title": "Zelensky: Russia must be held accountable for everything it has done", "content": "President Volodymyr Zelensky said in his evening address “that Russia must be held accountable for everything it has done.” The statement comes after Russia's missile attack on the Ukrainian city of on April 4 killed 19 people, including nine children, according to local authorities. Seventy four were reportedly injured. “Russian ballistics on a street in an ordinary city, into a residential area, and after that strike, an additional strike with drones. And another person died, and more were injured,” . “We need to put pressure on them there — really put pressure, don't waste time on empty talk — to end this war.” The U.S. and Ukraine agreed to a full ceasefire on March 11 but Russia rejected it. Instead, Ukraine, Russia, and the U.S. agreed on March 25 to a partial truce covering energy infrastructure and the Black Sea. However, the Kremlin has blocked the , saying that the Black Sea truce would take effect only after some sanctions against Russia are lifted. Russia and Ukraine have also accused each other of violating the ban on energy infrastructure strikes. The U.S., so far, had declined to put pressure on Russia to force Moscow into a ceasefire. \"Horrified that tonight a ballistic missile struck near a playground and restaurant in Kryvyi Rih,\" U.S. Ambassador Bridget Brink posted on X following a Russian missile attack on Kryvyi Rih on April 4. \"This is why the war must end.\" with Brink's refusal to denounce Russia for the strike, which included an Iskander ballistic missile with cluster munition touching down on a playground in Zelensky's hometown. \"Unpleasantly surprising,\" Zelensky said."},
{"url": "https://kyivindependent.com/russia-attacks-mykolaiv-with-drones-residential-buildings-on-fire/", "title": "Russia attacks Mykolaiv with drones, residential buildings on fire", "content": "Russia attacked the city of Mykolaiv with Shahed-type drones, Governor Vitalii Kim said late on April 5. “As a result of the attack using Shaheds on Mykolaiv, a fire broke out in two residential buildings,” Kim said. The attack occurred around 10 p.m. local time. A number of Russian kamikaze drones were detected flying over several Ukrainian regions, including Kharkiv, Poltava, Sumy, and Chernihiv oblasts. No reports on the number of casualties were available at the time of writing. The attack on Mykolaiv comes a day after a Russian missile attack on the Ukrainian city of Kryvyi Rih including nine children, according to local authorities. Seventy-four were reportedly injured. Russian forces reportedly launched a combined missile and drone attack on the Dnipropetrovsk Oblast city in the evening, setting buildings ablaze in residential districts. President said in his evening address “that for everything it has done.” “Russian ballistics down a street in an ordinary city, into a residential area, and after that strike, an additional strike with drones. And another person died, and more were injured,” Zelensky said. “We need to put pressure on them there — really put pressure, don't waste time on empty talk — to end this war.”"},
{"url": "https://kyivindependent.com/over-150-clashes-recorded-on-front-lines-half-of-them-near-pokrovsk-general-staff-reports/", "title": "Over 150 clashes recorded on front lines, half of them near Pokrovsk, General Staff reports", "content": "According to the April 5 evening report by the General Staff, 152 military encounters were recorded since the start of the day. “The most intense situation is in , , and directions,” the General Staff wrote. Sixty-five clashes were reported near Pokrovsk alone. According to Ukraine’s Armed Forces, Russia carried out 73 air strikes, dropping 106 guided bombs and using 844 kamikaze drones. Besides clashes on the front lines, Russia has actively attacked Ukrainian civilian sites. Russia of Mykolaiv with Shahed-type drones, Governor Vitalii Kim said late on April 5. A day prior, a Russian missile attack on the Ukrainian city of Kryvyi Rih including nine children, according to local authorities. Seventy-four were reportedly injured. Zelensky said in his evening address “that Russia must be held accountable for everything it has done.” The U.S. and Ukraine agreed to a full ceasefire on March 11 but Russia rejected it. Instead, Ukraine, Russia, and the U.S. agreed on March 25 to a partial truce covering energy infrastructure and the Black Sea. However, the Kremlin has blocked the partial ceasefire as well, saying that the Black Sea truce would take effect only after some sanctions against Russia are lifted."},
{"url": "https://kyivindependent.com/minerals-deal-disrupted-by-those-with-their-hand-in-the-till-us-official-claims/", "title": "Minerals deal disrupted by those with 'their hand in the till,' US official claims", "content": "The minerals deal between Ukraine and the U.S. is a \"win-win,\" but has been thrown off by Ukrainian leadership, U.S. Treasury Secretary Scott Bessent claimed in an interview released on April 4 with U.S. far-right political commentator Tucker Carlson. \"It's a genuine economic partnership... we don't make any money unless they make money, and you know who doesn't like that? People with their hand in the till,\" Bessent . \"(T)he Russians didn't like the look of this deal because they thought it was actually something durable for the U.S. people and the Ukrainian people,\" he added. Bessent said on April 2 that a would arrive in the U.S. in the coming days to work on the mineral agreement. The deal was previously set to be signed on February 28 with a visit by President to the White House. \"We're expecting a Ukrainian technical team (at the) beginning of next week, and I'm hopeful we can get this thing signed and go back to a win-win situation,\" Bessent said, confirming his earlier remarks. U.S. President wanted to use the deal as a signal that the U.S. stands with Ukraine as an economic partner, Bessent said, adding that it would incentivize Russia to negotiate an end to its war against Ukraine. \"The sequencing has been thrown off, but I think we can fix it,\" Bessent said, referring to the steps the U.S. plans to take in establishing a . Bessent said the deal will bring the and Ukraine \"closer together,\" prove the U.S. is not abandoning Ukraine, and show the American people the U.S. has an economic stake in Ukraine. \" ...because of various kleptocracy aspects, has been held back. So hopefully with U.S. assistance and President Trump engineering this peace deal, Ukrainian people can have a better future,\" Bessent claimed. Throughout his interview with Carlson, Bessent repeatedly claimed that the deal would benefit the U.S. and Ukraine. \"Ukraine succeeds, we succeed, and it could be a long-term partnership,\" Bessent said. \"If this deal works (the the U.S. has provided to Ukraine) could end up being small change,\" he said. Bessent claimed Zelensky said he would sign the minerals deal at the February , but never did. Bessent Zelensky in Kyiv on Feb. 12, where a deal was never signed. \"I thought it was important to take the agreement to and present it to President Zelensky,\" Bessent said. Bessent criticized Zelensky and his inner circle for failing to sign the deal on several occasions. \"He got to the Oval Office and blew up what should have been the easiest thing to do in the world,\" he said. Zelensky \"assumed a high-handed tone\" with U.S. officials, Carlson claimed in his interview with Bessent. \"He (Zelensky) is not getting the best advice... His advisors are not perfect,\" Bessent said. Ukrainian and U.S. officials have met in several times, where Ukraine has agreed to a full 30-day ceasefire. Russia has not."},
{"url": "https://kyivindependent.com/neo-nazi-terrorist-group-offering-locals-payment-to-carry-out-attacks-guardian-reports/", "title": "US neo-Nazi terrorist group pays recruits to carry out attacks in Ukraine, Guardian reports", "content": "A U.S. neo-Nazi terrorist group with links to Russia is offering locals payment to carry out attacks, the Guardian reported on April 5. Russia actively tries to recruit civilians in to spy on military targets and carry out terrorist attacks throughout the country. On April 3, at least one person was killed in a Kyiv . The Base is a neo-Nazi terrorist group established in 2018. The group's leader, Rinaldo Nazzaro, is a U.S. citizen who now lives in , Russia. Nazzaro is a former Federal Bureau of Investigation (FBI) and Pentagon employee. Locals are being asked to conduct attacks on \"electric power stations, military and police vehicles, military and police personnel, government buildings, (and) politicians” in various cities, including . \"Given Russia’s connections to the leadership of the Base, including offering sanctuary to its leader Rinaldo Nazzaro, there is a strong chance that this could very well be a Russian intelligence operation,\" geopolitics expert Colin Clarke the Guardian. The terrorist group was extensively investigated by the FBI since its founding in 2018. Under U.S. President administration, the FBI has cut back on investigations into far-right groups. Previously, the Base did not align itself with . The change likely means the terrorist group is carrying out sabotage across Europe, experts told the Guardian. \"Supporting and directing violent non-state actors, including racially and ethnically motivated violent extremists, is just another tool in the Kremlin’s hybrid warfare toolkit, and one which has repeatedly demonstrated that it’s willing to use,\" Clarke said. The Base is designated as a terrorist group in various jurisdictions, including , the EU, and the U.K. On April 4, Yuriy Fedko, an official in Dnipro, was killed in a . Police say several possible scenarios are being investigated, including an attack ordered by Russia to destabilize the situation in Ukraine."},
{"url": "https://kyivindependent.com/hungary-is-on-putins-team-estonian-fm-says/", "title": "Hungary is on 'Putin's team,' Estonian FM says", "content": "Estonian Foreign Minister Margus Tsahkna said Hungary is on \"Putin's team\" in an interview with German outlet Rheinische Post, published on April 5. \"To be divided, you would need two major parties. We have Hungary, a very weak country, that's on Putin's team. Not on our European team,\" Tsahkna . Hungary maintains positive relations with Russia in contrast with other EU members. On March 26, Hungarian Foreign Minister visited Moscow to discuss continued between the two countries. Tsahkna called for the to be established so that Hungary could not abuse its voting power in institutions that require unanimous consent. The U.K. and have led the coalition and have pledged to deploy a peacekeeping force in Ukraine to enforce a potential ceasefire. Talks among the willing nations are still ongoing. Stripping of its voting power in the EU \"is getting closer and closer,\" Tsahkna said. \"Article 7 of the Treaty on provides for the possibility of withdrawing a member state's voting rights if membership endangers the security of Europe and that of the other members.... (T)hat's exactly what (Hungarian Prime Minister Viktor) Orban is doing,\" Tsahkna said. Hungary has repeatedly opposed EU sanctions on and has opposed EU aid for Ukraine. Germany's incoming government, led by Friedrich Merz's conservative CDU/CSU alliance, wants the EU to adopt to punish countries that violate the bloc's core principles."},
{"url": "https://kyivindependent.com/general-staff-russia-has-lost-919-570-troops-in-ukraine-since-feb-24-2022-2/", "title": "General Staff: Russia has lost 919,570 troops in Ukraine since Feb. 24, 2022", "content": "Russia has lost 919,570 troops in Ukraine since the beginning of its full-scale invasion on Feb. 24, 2022, the General Staff of Ukraine's Armed Forces reported on April 3. This number includes 1,330 casualties Russian forces suffered just over the past day. According to the , Russia has also lost 10,554 tanks, 21,972 armored fighting vehicles, 43,050 vehicles and fuel tanks, 25,786 artillery systems, 1,354 multiple launch rocket systems, 1,124 air defense systems, 370 airplanes, 335 helicopters, 31,846 drones, 28 ships and boats, and one submarine."}
]